In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('../data_sets/titanic3.xls')
df.head()

# df.columns

# df.columns = df.columns.str.strip()

# df.columns

# df.info()

# df.describe()

# df.isnull().sum()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [3]:
df.isnull().sum().sort_values(ascending=False)

body         1188
cabin        1014
boat          823
home.dest     564
age           263
embarked        2
fare            1
pclass          0
survived        0
name            0
sex             0
sibsp           0
parch           0
ticket          0
dtype: int64

In [4]:
len(df.columns)

14

In [5]:
df.columns[df.isnull().sum() > 0]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [6]:
df = df.dropna(subset=['fare', 'embarked'])

In [7]:
df['age'] = df['age'].fillna(df['age'].mean())

In [8]:
df['home.dest'].value_counts()

home.dest
New York, NY                          64
London                                14
Montreal, PQ                          10
Paris, France                          9
Cornwall / Akron, OH                   9
                                      ..
Seattle, WA / Toledo, OH               1
India / Rapid City, SD                 1
Kontiolahti, Finland / Detroit, MI     1
Devonport, England                     1
Antwerp, Belgium / Stanton, OH         1
Name: count, Length: 368, dtype: int64

In [9]:
df['home.dest'] = df['home.dest'].fillna(df['home.dest'].mode()[0])

# Beyond 1
### Create a series (most_common_destinations) in which the index contains the unique values from the embarked column and the values are the most common destination for each value of embarked.

In [16]:
filename = '../data_sets/titanic3.xls'
df = pd.read_excel(filename)
# Beyond 1

In [10]:
# most_common_destinations = df.groupby('embarked')['home.dest'].apply(lambda x: x.mode()[0])

In [11]:
# most_common_destinations

In [17]:
from pandas import Series
most_common_destinations = Series([], dtype=object)

In [18]:
for embarked_value in df['embarked'].dropna().unique():
    most_common_destinations.loc[embarked_value] = df.loc[df['embarked']==embarked_value, 'home.dest'].value_counts().index[0]
    
most_common_destinations

S           New York, NY
C           New York, NY
Q    Ireland Chicago, IL
dtype: object

# Beyond 2
###  Replace NaN values in the home.dest column with values from embarked. (Because values in embarked and home.dest are distinct, this is an OK middle step.)

In [19]:
df['home.dest'] = df['home.dest'].fillna(df['embarked'])

# Beyond 3
### Use the most_common_destinations series to replace values in home.dest with the most common values for each embarkation point.

In [20]:
df['home.dest'] = df['home.dest'].replace(most_common_destinations)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"